---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Mesh Methods
Mesh Class See Also Send Feedback
---

The Mesh type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | ComputeSurfaceArea | Computes and returns the surface area of the mesh. The surface area is the sum of the areas of the constituent facets of the mesh. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
|  | Equals | Determines whether the specified Object is equal to the current Object.  (Inherited from GeometryObject.) |
|  | GetHashCode | Gets the integer value of the geometry object as hash code  (Inherited from GeometryObject.) |
|  | GetNormal | Returns a normal unit vector at the given index. |
|  | GetNormals | Returns all normals assigned to the mesh. |
|  | GetType | Gets the Type of the current instance. (Inherited from Object.) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also

Mesh Class

Autodesk.Revit.DB Namespace